Courses/7140/Lectures/Testing/testing-units.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Unit Testing</title>
<!-- 2016-03-23 Wed 15:28 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Unit Testing</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Unit Testing</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>OOP and programming language (PL) neutral term "unit"  cf. class, method
</li>
<li><i>Unit test</i>: test one invocation of one method of one isolated class with
one thread
</li>
<li>Tools for unit testing: JUnit and TestNG (both for any JVM based PL)
</li>
</ol>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Unit Testing</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>"The primary goal of unit testing is to take the smallest piece of
testable software in the application, isolate it from the remainder
of the code, and determine whether it behaves exactly as you
expect. Each unit is tested separately before integrating them into
modules to test the interfaces between modules. Unit testing has
proven its value in that a large percentage of defects are
identified during its use." [from msdn.microsoft.com]
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Unit Testing</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>"The most common approach to unit testing requires drivers and
stubs to be written. The driver simulates a calling unit and the
stub simulates a called unit. The investment of developer time in
this activity sometimes results in demoting unit testing to a lower
level of priority and that is almost always a mistake. Even though
the drivers and stubs cost time and money, unit testing provides
some undeniable advantages. It allows for automation of the testing
process, reduces difficulties of discovering errors contained in
more complex pieces of the application, and test coverage is often
enhanced because attention is given to each unit."  [from
msdn.microsoft.com]
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Unit Testing</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>We do not expect the methods being unit tested to:
<ol class="org-ol">
<li>Access the network
</li>
<li>Hit a database
</li>
<li>Alter the file system
</li>
<li>Spin up a thread
</li>
<li>etc.
</li>
</ol>
</li>
<li>A method that failed a unit test is almost always easy to rectify in minutes.
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Unit Test Generation for OOP code</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Write a test class TC for a class C to be tested.  Unit test
methods reside in TC source code files.  A test method <code>TC.tm()</code>
invokes a method <code>m</code> of <code>C</code>.  It knows what the expected result is.  It
asserts that the actual result equals expected.  TC.tm() creates one
or more objects of C.
</li>
<li>To invoke a method of a lower-level class, we must create argument
objects to pass.
</li>
<li>Much of the implied source code above is mechanically generatable
by parsing the source code of C.  
</li>
<li>All modern OOP IDE have this feature set.  They generated the
"boiler plate" code and we fill in the specifics of the test.
</li>
<li>To help with the above, the IDE suggests "annotations" (e.g.,
@test) and other naming conventions (e.g., class <code>MyClassTest</code> for
class <code>MyClass</code>)
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Java Reflection API</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Reflection API provides info re the class C
</li>

<li>At run time, by examining the C.class file (even without
C.java).
</li>

<li>Inspect and use classes, methods, attributes, &#x2026;
</li>

<li><a href="http://docs.oracle.com/javase/tutorial/reflect/index.html">http://docs.oracle.com/javase/tutorial/reflect/index.html</a>
</li>
<li>Example
<div class="org-src-container">

<pre class="src src-Java">Method med = foo.getClass().getMethod("doSomething", null);
med.invoke(foo, null);
</pre>
</div>
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> JUnit and TestNG</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="http://junit.org">JUnit.org</a> and <a href="http://TestNG.org">TestNG.org</a> are unit testing frameworks for Java with plugins
for IDEAJ, and Eclipse.
</li>

<li>Both use reflection.
</li>

<li><a href="http://go-gaga-over-testing.blogspot.com/2015/07/testng-vs-junit-annotations.html">TestNG  vs Junit</a> Feature comparison. 2015.
</li>
</ol>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Buzzwords</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li>POJO "Plain Old Java/ JavaScript Object"
</li>
<li><a href="https://en.wikipedia.org/wiki/Continuous_integration">CI server</a>  Continuous Integration server
</li>
<li><a href="http://www.seleniumhq.org/">Selenium</a>  a tool to emulate  user interaction with a web page.
</li>
<li><a href="https://www.w3.org/TR/webdriver/">WebDriver</a> An official W3C Specification.  A method of
interacting with a web browser.
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Yoonsik Cheon and Gary T. Leavens, "The JML and JUnit Way of Unit
Testing and its Implementation", February 2004 <a href="http://archives.cs.iastate.edu/documents/disk0/00/00/03/27/00000327-00/TR.pdf">PDF</a> Recommended
Reading.
</li>

<li><a href="http://www.cse.lehigh.edu/~glennb/oose/ppt/Junit.ppt">http://www.cse.lehigh.edu/~glennb/oose/ppt/Junit.ppt</a> Slides.
Recommended Reading.
</li>

<li><a href="http://www.sfs.uni-tuebingen.de/~vhenrich/ws12-13/java/slides/JUnit.pdf">http://www.sfs.uni-tuebingen.de/~vhenrich/ws12-13/java/slides/JUnit.pdf</a>
   2012 Slides. Recommended Reading.
</li>

<li><a href="http://beust.com/t/testng-gtac.ppt">Beyond JUnit: TestNG the next gen</a> PPT 50+ slides, Cédric Beust,
Designer of TestNG, 2007 <a href="./testNG-gtac-2007.ppt">./testNG-gtac-2007.ppt</a> Required Reading.
</li>

<li><a href="http://www.tutorialspoint.com/testng/">http://www.tutorialspoint.com/testng/</a> Recommended Reading.
</li>

<li><a href="http://tech.lds.org/wiki/images/5/5e/Unit_Testing_with_TestNG.pdf">http://tech.lds.org/wiki/images/5/5e/Unit_Testing_with_TestNG.pdf</a>
   lots of effective photos.  Recommended Reading.
</li>

<li>Several tutorials on YouTube.com!  Recommend back <b>one</b> that you
liked.
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2016-03-23
</div>
</body>
</html>
